#1.先把今天的rerank 的代码自己敲一遍
#2.自己再说一遍看能不能说出来
#3.自己从第一个节点开始捋一下全部流程 先把流程写下来，然后打开老师的.txt文件去对比
#4.过一遍 md中图片处理的代码和文本切分代码还有这个对问题的意图识别代码
#RAG项目 首先就是入口节点 加载非结构化文本文件  判断是pdf文件还是md文件，返回不同的状态
#接下来就是根据返回的状态走不同的路由边
#如果是pdf文件则走到pdf转md的节点  为了更好的保存文件的层级语义信息
'''
具体操作就是，先获得文件路径和文件，同时获取上一步返回的判断状态，如果是pdf状态那就要通过mineru对pdf文件进行转化，转为md文件
先发送请求上传文件到mineru，有请求三层考虑 网络层面请求是否成功/请求数据是否成功/请求结果是否符合预期，接下来就是轮询获取mineru对pdf的解析结果，如果解析成功返回一个压缩的zip的url
接下来就是解压缩 发送请求获取压缩路径对应的内容，就在响应中，如果请求成功拿到压缩内容， 给一个保存压缩文件的路径，保存压缩问价，解压 用zipfile.ZipFile（）api进行解压,拿到解压内容给解压内容存储路径，
存储后可以看到mineru对pdf进行解析后的文件名进行了改变，所以我们对文件进行重命名 先使用with_rename在内存中进行修改文件名 考虑到落盘问题，用rename()对文件进行落盘
落盘后对文件内容进行读取更新状态中的文件内容
'''

#接下来就是对md中图片进行处理  统一语义 保证上下文语义的完整性
'''
主要有两大步 一是对md图片中的摘要进行替换 根据图片的上下文信息调用大模型让模型生成图片摘要，而是对图片中的url路径替换，将本地url路径通过minio中间件替换为在线url
防御性编程  获得文件路径和文件及文件内容
遍历文件路径父路径下的图片目录获得图片列表
通过正则判断图片是否属于能够被md引用格式的图片
如果图片属于被md引用的格式那正则判断图片是否被md文件应用
如果被引用拿到图片的起始和结束位置
大模型限流问题   用滑动门算法进行处理用双向队列 进行判断一分钟内最大能给模型发送的请求次数是多少 
上来先盲清一下判断双向队列中是否有请求超过一分钟，如果有超过一分钟则清出队列
判断队列是否为
再获取图片的上下文将图片上下文进行存储到字典列表中，方便后期交给大模型去生成图片摘要
接下来就是构造大模型 将图片进行base64处理，出来后根据大模型提示词进行生成图片摘要
将图片的摘要进行存储方便后边替换

下一大步就是借助中间件minio对图片的url进行处理
首先定义工具 
接下来加载看桶中目录下有没有图片，进行幂等性删除，记得幂等性删除的对象是DeleteObject对象，删除后上传图片拿到url路径，进行保存
接下来就替换文件中图片的摘要和url
替换后保存为新的文件，更新状态
'''

#下一个节点进行对文本切分
'''
主要流程  粗分 按照标题进行一个章节一个章节的划分      接下来 长切短合   
加载进来已经对md文件图片处理后有完整上下文语义的文件进来，进行防御性编程 获取文件路径 文件及文件内容
按照标题进行切分
先统一换行符 然后按行进行切分 
遍历每行判断是否是代码围栏  正则判断  还有标志位  如果是代码围栏，切标志为为FALSE，那就是进入代码围栏 然后因为代码围栏有```或者~~~所以还要保存其是以哪个开头的
如果marker是==  上边保存的代码围栏的开头，那就是出代码框
如果既不是代码围栏 也 满足是标题的正则 则按标题进行拼接切片操作 ，从第一行切到当前标题行为一个章节依次组合为一个个章节 但是考虑到最后一个章节没有结束标题，所以切片直接从当前行切到最后 
上边完成将其进行保存到字典列表用于后续的长且断合

长切短合
给一个最大长度，遍历每个章节看是否超过最大长度，不超过最大长度和是表格的情况下不进行切分，如果超过最大长度则进行切分
所以需要构造文本切分器    对过长文本进行切分为保证语义的完整性 需要chunk_overlap 
切分后进行遍历  存储到字典列表中 记得part 进行标识同一章节切分后的部分 方便后边的溯源    

'''

#下一步识别主题   有些文本文件可能主题不清晰不便于后边的检索   这个节点的代码再好好过几遍
'''
主要流程 加载chunk调用大模型进行主题识别替换
先加载上一步返回的chunks 进行防御性编程 
构造大模型批量进行识别 识别主题后对主题进行向量化 定义向量化工具
构造表结构 表索引 创建表进行   然后幂等性删除库中的内容后插入数据到数据库中
然后进行保存向量化后的item_name为新的json文件

'''

#下一步向量化 切片后的所有chunks
'''
主要流程
加载切片后的chunks文件  进行防御性编程 拿到chunks 进行批次向量化
向量化后将稀疏向量和稠密向量回填到chunks字典列表中

将向量化后的chunks进行保存到一个新的json文件中
'''
#对向量化后的chunks进行存库操作

'''
拿到向量化后chunks 防御性编程 
创建表结构表索引表 进行存库 将所有chunks存储  记得加载表中的内容进行幂等性删除后再插入数据
 把插入数据返回的id,回填到对应的chunks
'''

#对问题的处理 根据用户的问题进行意图识别
'''
需要用到mongdb对会话历史记录进行存储  创建工具 对历史会话进行增删改查 
mongdb创建集合 数据库名.createCollection("集合名")
对集合（表中的数据进行增删改查）表名.insertOne/insertMany  增  表名.deleteOne() 表名.deleteMany()   改 表名.updateOne()/updateMany() 
查 表名.find()


识别用户问题需要获取到用户的问题
调用工具 
同时如果有问题需要将此问题也更新到历史记录中去
然后拿到想要的会话的最近几条历史记录
然后构建大模型将这几条历史记录交给大模型去识别用户的意图并重写用户的问题 
识别后对大模型返回的结果进行处理
对识别出的主题进行向量化方便后边的检索
然后回填更新重写用户问题和主题
'''

#下一步就是三路检索
'''
#首先向量化检索 混合检索工具的构造
 首先拿到重写的问题和识别出的用户意图    
 进行防御性编程
 对我们的问题进行向量化，向量化后和之前存库的chunks进行混合检索
 然后调用工具 获得reqs 和混合检索工具进行混合检索，对检索后的结果进行整理
 
#接下来就是假设性检索
拿到用户重写的问题和识别出的意图 
将问题交给大模型让大模型生成假设性答案 
将之前模型重写的问题和假设性的答案进行拼接向量化，向量化后进行混合型检索 步骤一样

#最后是网络搜索 

只需要拿到重写的用户问题 调用mcp工具进行检索 看官网进行操作  然后拿到网络搜索的结果对网络搜索的结果进行整理
'''

#rrf 倒数融合排序节点 将向量检索的结果和假设检索检索的结果进行融合重排 粗排  #相亲给你一堆照片让你粗筛不细究
'''
先拿到向量检索的结果和假设检索检索的结果 进行防御性编程 
然后给其分配权重 遍历获得所有chunks和权重 然后遍历所有的chunk 
rrf算法chunk 得分= 权重/（平滑系数+排名）
根据id看此chunk是否已在最后的chunk字典中（是因为可能向量检索中检索到了这个chunk,假设性检索有也出现了这个chunk)，如果不再在根据chunk_id拿到整个chunk放到字典中，如果在字典中就把另一个检索得到的分数直接加到原来的分数上
然后对结果字典根据得分进行排序
'''

#rerank 重排序  精排 先对rrf的结果和网络搜索的结果进行融合 然后调用重排序模型（定义工具）对结果进行重排序 重排序后断崖检测进行截断
'''
先拿到rrf的结果和网络搜索的结果进行融合 融合后对结果进行处理 只拿有用信息 然后调用工具进行重排，重排后顺序不一定是从大到小，所以对重拍后的结果再次调用sortedapi进行排序
排序后断崖检测，就是看得分是否突然断崖式下降如果得分断崖式下降将断崖后边的低质量文档噪声直接抛弃只要高质量文档 主要从绝对分差和相对比例两个层面进行考虑
高分下降绝对分差大，但相对比例会低但低分相对比例会高  如果分差大于绝对分差 或 相对比例差大于相对比例则进行截断 
如果分数都比较高没有分差过大或相对比例过大的则 取到动态最大保留文档数
'''
